/*Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
456 -> 5
782 -> 8
918 -> 1*/

Console.WriteLine("Программа выдает  цифру трехзачного числа введенного пользователем");
Console.Write("Введите трехзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());
while ( num < 100 || num > 999)
{
    Console.Write("Введено не трехзначное число. Введите трехзначное число: ");
    num = Convert.ToInt32(Console.ReadLine());
}
Console.WriteLine($"{num/10%10}");

